# Merging DataFrame

In [14]:
'''inner,outer,left,right,cross
default inner hota hai,means two dataframe mai common values hoti hai to merging ho sakti
df1.merge(df2,how="inner",on="empid")#means empid ke basis pe merging ho rahi hai#intersection ki tarah hai inner,outer union ki tarah hai
left:left ke sare and common between left and right aa jaega'''

'inner,outer,left,right,cross\ndefault inner hota hai,means two dataframe mai common values hoti hai to merging ho sakti\ndf1.merge(df2,how="inner",on="empid")#means empid ke basis pe merging ho rahi hai#intersection ki tarah hai inner,outer union ki tarah hai\nleft:left ke sare and common between left and right aa jaega'

In [15]:
import numpy as np
import pandas as pd

In [16]:
dict1={
    'emp_id':[1001,1002,1003,1004,],
    'sal':[20000,30000,40000,50000],
    'name':['amit','abhay','sorabh','mayank'],
    'age':[32,34,31,35]
}
dict1

{'emp_id': [1001, 1002, 1003, 1004],
 'sal': [20000, 30000, 40000, 50000],
 'name': ['amit', 'abhay', 'sorabh', 'mayank'],
 'age': [32, 34, 31, 35]}

In [17]:
df1=pd.DataFrame(dict1)
df1

   emp_id    sal    name  age
0    1001  20000    amit   32
1    1002  30000   abhay   34
2    1003  40000  sorabh   31
3    1004  50000  mayank   35

In [18]:
dict2={
    'emp_id':[1001,1002,1005,1006],
    'sal':[20000,30000,40000,50000],
    'address':['panipat','mohali','lucknow','noida']
}
dict2

{'emp_id': [1001, 1002, 1005, 1006],
 'sal': [20000, 30000, 40000, 50000],
 'address': ['panipat', 'mohali', 'lucknow', 'noida']}

In [19]:
df2=pd.DataFrame(dict2)
df2

   emp_id    sal  address
0    1001  20000  panipat
1    1002  30000   mohali
2    1005  40000  lucknow
3    1006  50000    noida

In [20]:
df1.merge(df2,how="inner",on="emp_id")#pd.merge(df1,df2) bhi likh sakte hai,intersection

   emp_id  sal_x   name  age  sal_y  address
0    1001  20000   amit   32  20000  panipat
1    1002  30000  abhay   34  30000   mohali

In [21]:
df1.merge(df2,how="outer",on="emp_id")#pd.merge(df1,df2,how='outer',on='emp_id') ,union

   emp_id    sal_x    name   age    sal_y  address
0    1001  20000.0    amit  32.0  20000.0  panipat
1    1002  30000.0   abhay  34.0  30000.0   mohali
2    1003  40000.0  sorabh  31.0      NaN      NaN
3    1004  50000.0  mayank  35.0      NaN      NaN
4    1005      NaN     NaN   NaN  40000.0  lucknow
5    1006      NaN     NaN   NaN  50000.0    noida

In [22]:
df1.merge(df2,how="left",on="emp_id")

   emp_id  sal_x    name  age    sal_y  address
0    1001  20000    amit   32  20000.0  panipat
1    1002  30000   abhay   34  30000.0   mohali
2    1003  40000  sorabh   31      NaN      NaN
3    1004  50000  mayank   35      NaN      NaN

In [23]:
pd.merge(df1,df2,how='left',on='emp_id',suffixes=('_x','_y'))

   emp_id  sal_x    name  age    sal_y  address
0    1001  20000    amit   32  20000.0  panipat
1    1002  30000   abhay   34  30000.0   mohali
2    1003  40000  sorabh   31      NaN      NaN
3    1004  50000  mayank   35      NaN      NaN

In [24]:
'''suffixes=('_x', '_y'): This specifies suffixes to use for overlapping column names in df1 and df2. 
******************If both DataFrames have columns with the same name other than emp_id,***********************
those in df1 will get the suffix _x and those in df2 will get the suffix _y'''

"suffixes=('_x', '_y'): This specifies suffixes to use for overlapping column names in df1 and df2. \n******************If both DataFrames have columns with the same name other than emp_id,***********************\nthose in df1 will get the suffix _x and those in df2 will get the suffix _y"

In [25]:
df1.merge(df2,how="right",on="emp_id")

   emp_id    sal_x   name   age  sal_y  address
0    1001  20000.0   amit  32.0  20000  panipat
1    1002  30000.0  abhay  34.0  30000   mohali
2    1005      NaN    NaN   NaN  40000  lucknow
3    1006      NaN    NaN   NaN  50000    noida

In [26]:
pd.merge(df1,df2,how='cross')

    emp_id_x  sal_x    name  age  emp_id_y  sal_y  address
0       1001  20000    amit   32      1001  20000  panipat
1       1001  20000    amit   32      1002  30000   mohali
2       1001  20000    amit   32      1005  40000  lucknow
3       1001  20000    amit   32      1006  50000    noida
4       1002  30000   abhay   34      1001  20000  panipat
5       1002  30000   abhay   34      1002  30000   mohali
6       1002  30000   abhay   34      1005  40000  lucknow
7       1002  30000   abhay   34      1006  50000    noida
8       1003  40000  sorabh   31      1001  20000  panipat
9       1003  40000  sorabh   31      1002  30000   mohali
10      1003  40000  sorabh   31      1005  40000  lucknow
11      1003  40000  sorabh   31      1006  50000    noida
12      1004  50000  mayank   35      1001  20000  panipat
13      1004  50000  mayank   35      1002  30000   mohali
14      1004  50000  mayank   35      1005  40000  lucknow
15      1004  50000  mayank   35      1006  50000    noida

# DATETIME LIBRARY

In [28]:
import datetime as dt

In [29]:
today=dt.date(2024,7,4)#(YYYY,MM,DD)
today

datetime.date(2024, 7, 4)

In [30]:
today.day

4

In [31]:
today.month

7

In [32]:
today.year

2024

In [52]:
today=dt.datetime(2024,7,4,10,38,45)

In [54]:
today

datetime.datetime(2024, 7, 4, 10, 38, 45)

In [98]:
today.month

7

In [100]:
today.day

4

In [102]:
today.time

In [60]:
pd.Timestamp('2024/07/04 10:41:30')

Timestamp('2024-07-04 10:41:30')

In [88]:
dateindex=pd.DatetimeIndex(['2024/07/04','2024/07/03','2024/07/02','2024/07/01'])
dateindex

DatetimeIndex(['2024-07-04', '2024-07-03', '2024-07-02', '2024-07-01'], dtype='datetime64[ns]', freq=None)

In [90]:
temp=[34,37,38,39]

In [96]:
temp_day=pd.Series(data=temp,index=dateindex)
temp_day

2024-07-04    34
2024-07-03    37
2024-07-02    38
2024-07-01    39
dtype: int64

In [110]:
pd.to_datetime(['july 4 2024','2024/07/04','6th dec 2023','today'],infer_datetime_format=True,errors='ignore')

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_19488\3110145246.py:1: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  pd.to_datetime(['july 4 2024','2024/07/04','6th dec 2023','today'],infer_datetime_format=True,errors='ignore')
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_19488\3110145246.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pd.to_datetime(['july 4 2024','2024/07/04','6th dec 2023','today'],infer_datetime_format=True,errors='ignore')

DatetimeIndex([       '2024-07-04 00:00:00',        '2024-07-04 00:00:00',
                      '2023-12-06 00:00:00', '2024-07-04 10:58:19.407839'],
              dtype='datetime64[ns]', freq=None)

In [116]:
pd.date_range(start='2024/07/04',end='2024/12/15',freq='W')#week W

DatetimeIndex(['2024-07-07', '2024-07-14', '2024-07-21', '2024-07-28',
               '2024-08-04', '2024-08-11', '2024-08-18', '2024-08-25',
               '2024-09-01', '2024-09-08', '2024-09-15', '2024-09-22',
               '2024-09-29', '2024-10-06', '2024-10-13', '2024-10-20',
               '2024-10-27', '2024-11-03', '2024-11-10', '2024-11-17',
               '2024-11-24', '2024-12-01', '2024-12-08', '2024-12-15'],
              dtype='datetime64[ns]', freq='W-SUN')

In [118]:
pd.date_range(start='2024/07/04',end='2024/12/15',freq='8H')#8-8 gante ke kitne slot banegae:493

DatetimeIndex(['2024-07-04 00:00:00', '2024-07-04 08:00:00',
               '2024-07-04 16:00:00', '2024-07-05 00:00:00',
               '2024-07-05 08:00:00', '2024-07-05 16:00:00',
               '2024-07-06 00:00:00', '2024-07-06 08:00:00',
               '2024-07-06 16:00:00', '2024-07-07 00:00:00',
               ...
               '2024-12-12 00:00:00', '2024-12-12 08:00:00',
               '2024-12-12 16:00:00', '2024-12-13 00:00:00',
               '2024-12-13 08:00:00', '2024-12-13 16:00:00',
               '2024-12-14 00:00:00', '2024-12-14 08:00:00',
               '2024-12-14 16:00:00', '2024-12-15 00:00:00'],
              dtype='datetime64[ns]', length=493, freq='8H')

In [120]:
pd.date_range(start='2024/07/04',end='2024/12/15',freq='2D')# 2-2 din

DatetimeIndex(['2024-07-04', '2024-07-06', '2024-07-08', '2024-07-10',
               '2024-07-12', '2024-07-14', '2024-07-16', '2024-07-18',
               '2024-07-20', '2024-07-22', '2024-07-24', '2024-07-26',
               '2024-07-28', '2024-07-30', '2024-08-01', '2024-08-03',
               '2024-08-05', '2024-08-07', '2024-08-09', '2024-08-11',
               '2024-08-13', '2024-08-15', '2024-08-17', '2024-08-19',
               '2024-08-21', '2024-08-23', '2024-08-25', '2024-08-27',
               '2024-08-29', '2024-08-31', '2024-09-02', '2024-09-04',
               '2024-09-06', '2024-09-08', '2024-09-10', '2024-09-12',
               '2024-09-14', '2024-09-16', '2024-09-18', '2024-09-20',
               '2024-09-22', '2024-09-24', '2024-09-26', '2024-09-28',
               '2024-09-30', '2024-10-02', '2024-10-04', '2024-10-06',
               '2024-10-08', '2024-10-10', '2024-10-12', '2024-10-14',
               '2024-10-16', '2024-10-18', '2024-10-20', '2024-10-22',
               '2024-10-24', '2024-10-26', '2024-10-28', '2024-10-30',
               '2024-11-01', '2024-11-03', '2024-11-05', '2024-11-07',
               '2024-11-09', '2024-11-11', '2024-11-13', '2024-11-15',
               '2024-11-17', '2024-11-19', '2024-11-21', '2024-11-23',
               '2024-11-25', '2024-11-27', '2024-11-29', '2024-12-01',
               '2024-12-03', '2024-12-05', '2024-12-07', '2024-12-09',
               '2024-12-11', '2024-12-13', '2024-12-15'],
              dtype='datetime64[ns]', freq='2D')

In [122]:
pd.date_range(start='2024/07/04',end='2024/12/15',freq='D')#day

DatetimeIndex(['2024-07-04', '2024-07-05', '2024-07-06', '2024-07-07',
               '2024-07-08', '2024-07-09', '2024-07-10', '2024-07-11',
               '2024-07-12', '2024-07-13',
               ...
               '2024-12-06', '2024-12-07', '2024-12-08', '2024-12-09',
               '2024-12-10', '2024-12-11', '2024-12-12', '2024-12-13',
               '2024-12-14', '2024-12-15'],
              dtype='datetime64[ns]', length=165, freq='D')

In [124]:
pd.date_range(start='2024/07/04',end='2024/12/15',periods=12)#12

DatetimeIndex([          '2024-07-04 00:00:00',
               '2024-07-18 21:49:05.454545454',
               '2024-08-02 19:38:10.909090909',
               '2024-08-17 17:27:16.363636363',
               '2024-09-01 15:16:21.818181818',
               '2024-09-16 13:05:27.272727272',
               '2024-10-01 10:54:32.727272727',
               '2024-10-16 08:43:38.181818182',
               '2024-10-31 06:32:43.636363636',
               '2024-11-15 04:21:49.090909090',
               '2024-11-30 02:10:54.545454544',
                         '2024-12-15 00:00:00'],
              dtype='datetime64[ns]', freq=None)